HELYXcore-4.4.0/examples/legacy/multiphase/overInterDyMFoam/floatingBody/background/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oversetPatch
    {
        type            overset;
    }
    stationaryWalls
    {
        type            fixedFluxPressure;
    }
    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }
    floatingObject
    {
        type            fixedFluxPressure;
    }
    overset
    {
        patchType       overset;
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
